---
kind: type
id: T:Autodesk.Revit.DB.ExportPDFSettings
source: html/66156539-3f22-d986-ea46-49e772d1c451.htm
---
# Autodesk.Revit.DB.ExportPDFSettings

Settings for PDF export

## Syntax (C#)
```csharp
public class ExportPDFSettings : Element
```